/*
Чистит экран:
system("cls");

Создание динамического массива:
int* chosenGadget = new int[n] {0};

Создания динамического квадратного массива:
float** A = new float *[n] {0}; // При объявлении сразу зануляем всю матрицу
for (i = 0; i < n; i++)
	A[i] = new float[n] {0};

Дополнительные параметры для времени:
//cout << t.wHour << endl;   //часы
//cout << t.wMinute << endl; //минуты
//cout << t.wSecond << endl; //секунды

Пример получения длины строки:
gadgetString[i].length();

выход из проги (не работает):
cout << "Конец программы. Для выхода нажмите Enter" << endl;
char closeProgramm = getchar(); //выход с проги через Enter
if (closeProgramm == '\n');		//..

разделить окна можно с помощью значка в правом верхнем углу (потянуть вниз)

Что делает функция array.foreach(...) ????


*/

