/*
Конспект срр:
1) Рекурсия и цикл - взаимозаменяемы

Лайфхаки для Visual Studio 2022:
1) Разделить окна можно с помощью значка в правом верхнем углу (потянуть вниз)

Полезные функции:
system("cls");                              // Отчистить экран
int* chosenGadget = new int[n] {0};			// Создать динамический массив и занулить его
float** A = new float *[n] {0};  			// Создать динамический квадратный массив и занулить его
for (i = 0; i < n; i++)						// ..
	A[i] = new float[n] {0};				// ..
gadgetString[i].length();					// Получение длины строки
ws.merge_cells("C3:C4"); 					// Объединить ячейки       (xlnt)
ws.cell("C3").formula("=RAND()"); 			// Ввести формулу в ячейку (xlnt)
cout << t.wHour << endl;					// Вывести часы	   (ctime)
cout << t.wMinute << endl;					// Вывести минуты  (ctime)
cout << t.wSecond << endl;					// Вывести секунды (ctime)












*/

